
from itertools import chain

PROVINCE_CITY_MAP = {
    "البرز": ["کرج", "فردیس", "کمال‌شهر", "نظرآباد", "محمدشهر"],
    "اردبیل": ["اردبیل", "پارس‌آباد", "مشگین‌شهر", "خلخال", "بیله‌سوار"],
    "آذربایجان شرقی": ["تبریز", "مراغه", "اهر", "مرند", "میانه"],
    "آذربایجان غربی": ["ارومیه", "خوی", "بوکان", "مهاباد", "ماکو"],
    "بوشهر": ["بوشهر", "برازجان", "بندر گناوه", "کنگان", "دیلم"],
    "چهارمحال و بختیاری": ["شهرکرد", "بروجن", "لردگان", "فارسان", "اردل"],
    "فارس": ["شیراز", "مرودشت", "جهرم", "فسا", "کازرون"],
    "گیلان": ["رشت", "بندر انزلی", "لاهیجان", "لنگرود", "آستارا"],
    "گلستان": ["گرگان", "گنبد کاووس", "بندر ترکمن", "علی‌آباد", "کردکوی"],
    "همدان": ["همدان", "ملایر", "نهاوند", "تویسرکان", "اسدآباد"],
    "هرمزگان": ["بندرعباس", "میناب", "قشم", "کیش", "بندرلنگه"],
    "ایلام": ["ایلام", "دهلران", "ایوان", "آبدانان", "دره‌شهر"],
    "اصفهان": ["اصفهان", "کاشان", "خمینی‌شهر", "نجف‌آباد", "شاهین‌شهر"],
    "کرمان": ["کرمان", "سیرجان", "رفسنجان", "جیرفت", "بم"],
    "کرمانشاه": ["کرمانشاه", "اسلام‌آباد غرب", "جوانرود", "سنقر", "پاوه"],
    "خراسان شمالی": ["بجنورد", "شیروان", "اسفراین", "آشخانه", "فاروج"],
    "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار", "قوچان", "تربت حیدریه"],
    "خراسان جنوبی": ["بیرجند", "قائن", "طبس", "فردوس", "نهبندان"],
    "خوزستان": ["اهواز", "آبادان", "دزفول", "خرمشهر", "بندر ماهشهر"],
    "کهگیلویه و بویراحمد": ["یاسوج", "گچساران", "دوگنبدان", "دهدشت", "چرام"],
    "کردستان": ["سنندج", "سقز", "مریوان", "بانه", "قروه"],
    "لرستان": ["خرم‌آباد", "بروجرد", "دورود", "الیگودرز", "کوهدشت"],
    "مرکزی": ["اراک", "ساوه", "خمین", "محلات", "دلیجان"],
    "مازندران": ["ساری", "بابل", "آمل", "قائم‌شهر", "نکا"],
    "قزوین": ["قزوین", "تاکستان", "الوند", "بوئین‌زهرا", "آبیک"],
    "قم": ["قم", "قنوات", "جعفریه", "کهک", "سلفچگان"],
    "سمنان": ["سمنان", "شاهرود", "دامغان", "گرمسار", "مهدی‌شهر"],
    "سیستان و بلوچستان": ["زاهدان", "زابل", "ایرانشهر", "چابهار", "خاش"],
    "تهران": ["تهران", "اسلام‌شهر", "ملارد", "شهریار", "ورامین"],
    "یزد": ["یزد", "اردکان", "میبد", "بافق", "تفت"],
    "زنجان": ["زنجان", "ابهر", "خرمدره", "قیدار", "سلطانیه"],
}

PROVINCES = list(PROVINCE_CITY_MAP.keys()) 

ALL_CITIES = []

# for cities in PROVINCE_CITY_MAP.values():
#     ALL_CITIES.extend(cities)
#
# ALL_CITIES = sorted(set(ALL_CITIES))

ALL_CITIES = list(dict.fromkeys(chain.from_iterable(PROVINCE_CITY_MAP.values())))


